

------------------------------------------------------------------------------------------------------------------------------
SPARQL results
------------------------------------------------------------------------------------------------------------------------------

Query A: 


PREFIX schema: <https://schema.org/> 
PREFIX vinted: <http://semanticweb2025.group5/vinted/>

SELECT ?item_name ?primary_category ?secondary_category ?item_brand
WHERE {

  ?item schema:name ?item_name;
        vinted:primaryCategory ?primary_category;
        vinted:secondaryCategory ?secondary_category;
        schema:brand ?item_brand.


} LIMIT 1

print(f"Name: {row.item_name}\nCategory: {row.primary_category}\nSubCategory: {row.secondary_category}\nBrand: {row.item_brand}")

Results:

Name: Abercrombie & Fitch Cropped Sweater Juniors Or Women’s Size XS Fall
Category: http://semanticweb2025.group5/vinted/Women
SubCategory: http://semanticweb2025.group5/vinted/Clothing
Brand: http://semanticweb2025.group5/vinted/AbercrombieFitch
------------

Query B: 

PREFIX schema: <https://schema.org/> 
PREFIX vinted: <http://semanticweb2025.group5/vinted/>

SELECT ?brand_name ?item_name_1 ?item_subcategory_1 ?item_name_2 ?item_subcategory_2
WHERE {

    ?brand schema:name ?brand_name.

    ?item schema:name ?item_name_1;
        vinted:primaryCategory ?item_category_1;
        vinted:secondaryCategory ?item_subcategory_1;
        schema:brand ?brand.
        
    ?item2 schema:name ?item_name_2;
        vinted:primaryCategory ?item_category_2;
        vinted:secondaryCategory ?item_subcategory_2;
        schema:brand ?brand.


    FILTER(?item_subcategory_2!=?item_subcategory_1)

} 

Results:

Brand: Lululemon
Item_1: Lululemon Dual Pouch Wristlet Black and Gold Wordmark New With Tags
SubCategory_Item_1: http://semanticweb2025.group5/vinted/Bags
Item_2: Lululemon top
SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing


Brand: Lululemon
Item_1: Lululemon top
SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing
Item_2: Lululemon Dual Pouch Wristlet Black and Gold Wordmark New With Tags
SubCategory_Item_2: http://semanticweb2025.group5/vinted/Bags


Brand: Amazon
Item_1: Steamer
SubCategory_Item_1: http://semanticweb2025.group5/vinted/Smallkitchenappliances
Item_2: Swinging pet bed
SubCategory_Item_2: http://semanticweb2025.group5/vinted/Petcare


Brand: Amazon
Item_1: Swinging pet bed
SubCategory_Item_1: http://semanticweb2025.group5/vinted/Petcare
Item_2: Steamer
SubCategory_Item_2: http://semanticweb2025.group5/vinted/Smallkitchenappliances
------------

Query C: 

PREFIX schema: <https://schema.org/> 
PREFIX vinted: <http://semanticweb2025.group5/vinted/>

SELECT ?brand_name (AVG(?item_price) AS ?avg_price)
WHERE {

    ?brand schema:name ?brand_name.

    ?item schema:brand ?brand;
        schema:price ?item_price.

} GROUP BY ?brand_name
LIMIT 10

Results:

Abercrombie & Fitch 5.0
BrandUnknown 7.538461538461538461538461538
Converse 16.0
Empyre 13.0
Dolly 20.0
Chogan 45.0
Coach 55.0
Espresso 55.0
Corningware 12.0
Crock Pot 10.0
------------

Query D: 

PREFIX schema: <https://schema.org/> 
PREFIX vinted: <http://semanticweb2025.group5/vinted/>

SELECT ?brand_name (AVG(?item_price) AS ?avg_price)
WHERE {
  ?item vinted:primaryCategory vinted:Men ;
        schema:name ?item_name ;
        schema:brand ?brand ;
        schema:price ?item_price .
  ?brand schema:name ?brand_name .
}
GROUP BY  ?brand_name
ORDER BY ?avg_price
LIMIT 10


Results:

Brand:Lattafa
Avg_price:5.0

Brand:NO LABEL
Avg_price:10.0

Brand:Guy Clarac
Avg_price:15.0

Brand:The North Face
Avg_price:15.0

Brand:Ed Hardy
Avg_price:20.0

Brand:Dior
Avg_price:40.0

Brand:ibex
Avg_price:40.0

Brand:Chogan
Avg_price:45.0

Brand:Adidas
Avg_price:75.0
------------

Query E: 

PREFIX wdt: <http://www.wikidata.org/prop/direct/>
PREFIX wd: <http://www.wikidata.org/entity/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX bd: <http://www.bigdata.com/rdf#>
PREFIX wikibase: <http://wikiba.se/ontology#>

SELECT ?brandLabel ?inceptionDate ?founderLabel ?headquartersLabel (GROUP_CONCAT(DISTINCT ?industryLabel; SEPARATOR=", ") AS ?industries) ?officialWebsite
WHERE {
  BIND(wd:Q3895 AS ?brand)

  OPTIONAL { ?brand wdt:P571 ?inceptionDate. }
  OPTIONAL { ?brand wdt:P112 ?founder. }
  OPTIONAL { ?brand wdt:P159 ?headquarters. }
  OPTIONAL { ?brand wdt:P856 ?officialWebsite. }
  OPTIONAL { ?brand wdt:P452 ?industry. }

  SERVICE wikibase:label {
    bd:serviceParam wikibase:language "en".
    ?brand rdfs:label ?brandLabel.
    ?founder rdfs:label ?founderLabel.
    ?headquarters rdfs:label ?headquartersLabel.
    ?industry rdfs:label ?industryLabel. 
  }
}
GROUP BY ?brandLabel ?inceptionDate ?founderLabel ?headquartersLabel ?officialWebsite
LIMIT 1

Results:

Brand: Adidas AG
Inception: 1924-07-01T00:00:00Z
Founder: Adolf Dassler
Headquarters: Herzogenaurach
Industries: textile industry, sport industry
Website: https://adidas-group.com

------------

Query F: 


-- INSERT SPARQL FORMULATION OF YOUR QUERY--


Results:


------
------------

Query G: 

Brands in one category (Women) sorted by how many items they have + the brand's average price:

This query shows which brands have the largest Men assortment and their average price, enabling smarter ranking, 
filters, and brand curation. It also informs pricing and promotions by revealing typical price points per brand, 
improving user expectations and conversion.


PREFIX schema: <https://schema.org/> 
PREFIX vinted: <http://semanticweb2025.group5/vinted/>
PREFIX xsd:    <http://www.w3.org/2001/XMLSchema#>

SELECT ?brand_name (COUNT(?item) AS ?num_items) (AVG(xsd:decimal(?item_price)) AS ?avg_price)
WHERE {
  ?item vinted:primaryCategory vinted:Women ;
        schema:brand ?brand ;
        schema:price ?item_price .
  ?brand schema:name ?brand_name .
}
GROUP BY ?brand_name
ORDER BY DESC(?num_items) ?avg_price
LIMIT 10


Results:
BrandUnknown 2 13.5
Lululemon 2 15.0
Abercrombie & Fitch 1 5.0
Levi's 1 6.0
Unique Vintage 1 7.0
Empyre 1 13.0
Converse 1 16.0
GUESS 1 19.0
Nike 1 20.0
Skechers 1 20.0


-----------------------------------------------------------------------------------------------------------------------------

