

------------------------------------------------------------------------------------------------------------------------------
SPARQL results
------------------------------------------------------------------------------------------------------------------------------

Query A: 


PREFIX schema: <https://schema.org/> 
PREFIX vinted: <http://semanticweb2025.group5/vinted/>

SELECT ?item_name ?primary_category ?secondary_category ?item_brand
WHERE {

  ?item schema:name ?item_name;
        vinted:primaryCategory ?primary_category;
        vinted:secondaryCategory ?secondary_category;
        schema:brand ?item_brand.


} LIMIT 1

print(f"Name: {row.item_name}\nCategory: {row.primary_category}\nSubCategory: {row.secondary_category}\nBrand: {row.item_brand}")

Results:

Name: Abercrombie & Fitch Cropped Sweater Juniors Or Women’s Size XS Fall
Category: http://semanticweb2025.group5/vinted/Women
SubCategory: http://semanticweb2025.group5/vinted/Clothing
Brand: http://semanticweb2025.group5/vinted/AbercrombieFitch
------------

Query B: 

PREFIX schema: <https://schema.org/> 
PREFIX vinted: <http://semanticweb2025.group5/vinted/>

SELECT ?brand_name ?item_name_1 ?item_subcategory_1 ?item_name_2 ?item_subcategory_2
WHERE {

    ?brand schema:name ?brand_name.

    ?item schema:name ?item_name_1;
        vinted:primaryCategory ?item_category_1;
        vinted:secondaryCategory ?item_subcategory_1;
        schema:brand ?brand.
        
    ?item2 schema:name ?item_name_2;
        vinted:primaryCategory ?item_category_2;
        vinted:secondaryCategory ?item_subcategory_2;
        schema:brand ?brand.


    FILTER(?item_subcategory_2!=?item_subcategory_1)

} 

Results:

Brand: Lululemon
Item_1: Lululemon Dual Pouch Wristlet Black and Gold Wordmark New With Tags
SubCategory_Item_1: http://semanticweb2025.group5/vinted/Bags
Item_2: Lululemon top
SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing


Brand: Lululemon
Item_1: Lululemon top
SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing
Item_2: Lululemon Dual Pouch Wristlet Black and Gold Wordmark New With Tags
SubCategory_Item_2: http://semanticweb2025.group5/vinted/Bags


Brand: Amazon
Item_1: Steamer
SubCategory_Item_1: http://semanticweb2025.group5/vinted/Smallkitchenappliances
Item_2: Swinging pet bed
SubCategory_Item_2: http://semanticweb2025.group5/vinted/Petcare


Brand: Amazon
Item_1: Swinging pet bed
SubCategory_Item_1: http://semanticweb2025.group5/vinted/Petcare
Item_2: Steamer
SubCategory_Item_2: http://semanticweb2025.group5/vinted/Smallkitchenappliances
------------

Query C: 


-- INSERT SPARQL FORMULATION OF YOUR QUERY--


Results:


------------

Query D: 


-- INSERT SPARQL FORMULATION OF YOUR QUERY--


Results:


------------

Query E: 


-- INSERT SPARQL FORMULATION OF YOUR QUERY--


Results:


------------

Query F: 


-- INSERT SPARQL FORMULATION OF YOUR QUERY--


Results:


------
------------

Query G: 

-- INSERT TEST OF YOUR QUERY QUESTION -


-- INSERT SPARQL FORMULATION OF YOUR QUERY--


Results:



-----------------------------------------------------------------------------------------------------------------------------

