{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "94d14b52",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph, Literal, Namespace"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "8973346f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N8c2ee37078b74e6690e5114ff7478f02 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g = Graph()\n",
    "g.parse(\"5_ken3140_webshop.ttl\", format=\"ttl\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "88abb292",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://semanticweb2025.group5/vinted/item_PapaRoachParamourSessionsCD_7072381990 https://schema.org/price 6.0\n",
      "http://semanticweb2025.group5/vinted/item_LattafaDukhan_7007038949 https://schema.org/itemCondition New with tags\n",
      "http://semanticweb2025.group5/vinted/item_EnhypenRomanceUntoldAlbum_6871106441 http://semanticweb2025.group5/vinted/primaryCategory http://semanticweb2025.group5/vinted/Entertaiment\n",
      "http://semanticweb2025.group5/vinted/item_Zapatillas_7063942633 https://schema.org/brand http://semanticweb2025.group5/vinted/Skechers\n",
      "http://semanticweb2025.group5/vinted/item_BlackAndWhiteConverseShoes_7072439359 https://schema.org/itemCondition Very good\n",
      "http://semanticweb2025.group5/vinted/Sheffield https://schema.org/name Sheffield\n",
      "http://semanticweb2025.group5/vinted/item_CoachSignaturePurse_7051847400 https://schema.org/itemCondition Very good \n",
      "http://semanticweb2025.group5/vinted/item_MidwestSpreePetCarrier_7066098977 https://schema.org/brand http://semanticweb2025.group5/vinted/midwest\n",
      "http://semanticweb2025.group5/vinted/CookwareBakeware http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n",
      "http://semanticweb2025.group5/vinted/item_LanaDelReyChemtrailsCD_6721147567 http://semanticweb2025.group5/vinted/secondaryCategory http://semanticweb2025.group5/vinted/Music\n",
      "http://semanticweb2025.group5/vinted/item_TaylorSwiftMidnightsMoonstoneBlue_6431064401 https://schema.org/brand http://semanticweb2025.group5/vinted/BrandUnknown\n",
      "http://semanticweb2025.group5/vinted/item_ISpyThingThatFlingsDVD_7061364696 https://schema.org/price 5.0\n",
      "http://semanticweb2025.group5/vinted/item_LeopardPrintLingerieDress_7072400616 https://schema.org/color Beige, Black\n",
      "http://semanticweb2025.group5/vinted/item_CrockPot_7016875144 http://semanticweb2025.group5/vinted/secondaryCategory http://semanticweb2025.group5/vinted/Smallkitchenappliances\n",
      "http://semanticweb2025.group5/vinted/item_LeopardPrintLingerieDress_7072400616 http://semanticweb2025.group5/vinted/secondaryCategory http://semanticweb2025.group5/vinted/Clothing\n",
      "http://semanticweb2025.group5/vinted/item_Chogan118_3162020098 https://schema.org/price 45.0\n",
      "http://semanticweb2025.group5/vinted/item_DiorHomme_4241982335 http://semanticweb2025.group5/vinted/secondaryCategory http://semanticweb2025.group5/vinted/Grooming\n",
      "http://semanticweb2025.group5/vinted/drloton https://schema.org/name drloton\n",
      "http://semanticweb2025.group5/vinted/item_MidwestSpreePetCarrier_7066098977 https://schema.org/name Midwest Spree hard sided plastic extra vented pet carrier\n",
      "http://semanticweb2025.group5/vinted/item_SpoonTeabagPlate_6377063646 http://semanticweb2025.group5/vinted/primaryCategory http://semanticweb2025.group5/vinted/Home\n",
      "http://semanticweb2025.group5/vinted/item_JustKids_7075705549 https://schema.org/color English\n",
      "http://semanticweb2025.group5/vinted/Lattafa http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Brand\n",
      "http://semanticweb2025.group5/vinted/item_KhakiBoots_7029761685 https://schema.org/itemCondition Very good\n",
      "http://semanticweb2025.group5/vinted/TheNorthFace http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Brand\n",
      "http://semanticweb2025.group5/vinted/adidas http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Brand\n",
      "http://semanticweb2025.group5/vinted/item_CrockPot_7016875144 https://schema.org/color Black, Silver\n",
      "http://semanticweb2025.group5/vinted/primaryCategory http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/1999/02/22-rdf-syntax-ns#Property\n",
      "http://semanticweb2025.group5/vinted/item_CrockPotSmall_7008639345 http://semanticweb2025.group5/vinted/primaryCategory http://semanticweb2025.group5/vinted/Home\n",
      "http://semanticweb2025.group5/vinted/item_VintageGuessShoulderBag_7059028695 https://schema.org/size not specified\n",
      "http://semanticweb2025.group5/vinted/CookwareBakeware http://www.w3.org/2000/01/rdf-schema#subClassOf http://semanticweb2025.group5/vinted/Home\n",
      "http://semanticweb2025.group5/vinted/item_NikeInfinityFlynitWomens_7051252291 https://schema.org/name Nike Infinity Flynit Women's\n",
      "http://semanticweb2025.group5/vinted/item_BlackRelaxEmpyreSkaterBlack_7071973949 https://schema.org/price 13.0\n",
      "http://semanticweb2025.group5/vinted/item_SpringerSpaniel_5766048610 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/alphie https://schema.org/name alphie\n",
      "http://semanticweb2025.group5/vinted/item_AbercrombieFitchCroppedSweaterJuniorsOrWomensSizeXSFall_7057532907 https://schema.org/itemCondition Very good\n",
      "http://semanticweb2025.group5/vinted/item_EnhypenRomanceUntoldAlbum_6871106441 https://schema.org/brand http://semanticweb2025.group5/vinted/BrandUnknown\n",
      "http://semanticweb2025.group5/vinted/item_VintageGuessShoulderBag_7059028695 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/item_TaylorSwiftMidnightsMoonstoneBlue_6431064401 http://semanticweb2025.group5/vinted/primaryCategory http://semanticweb2025.group5/vinted/Entertaiment\n",
      "https://schema.org/name http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/1999/02/22-rdf-syntax-ns#Property\n",
      "http://semanticweb2025.group5/vinted/item_HocusPocusCookieCutters_6964566662 http://semanticweb2025.group5/vinted/primaryCategory http://semanticweb2025.group5/vinted/Home\n",
      "http://semanticweb2025.group5/vinted/item_BlackRelaxEmpyreSkaterBlack_7071973949 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/item_MidwestSpreePetCarrier_7066098977 https://schema.org/size S\n",
      "http://semanticweb2025.group5/vinted/item_IbexBelt_7044814371 https://schema.org/name Vintage Ibex Brown Leather Belt Men’s 46\n",
      "http://semanticweb2025.group5/vinted/item_TaylorSwiftMidnightsMoonstoneBlue_6431064401 https://schema.org/name Midnights Taylor Swift moonstone blue ed\n",
      "http://semanticweb2025.group5/vinted/item_IbexBelt_7044814371 https://schema.org/color Brown, Gold\n",
      "http://semanticweb2025.group5/vinted/item_IbexBelt_7044814371 http://semanticweb2025.group5/vinted/primaryCategory http://semanticweb2025.group5/vinted/Men\n",
      "http://semanticweb2025.group5/vinted/item_StrawberryDish_7051854690 https://schema.org/name Strawberry dish\n",
      "http://semanticweb2025.group5/vinted/item_JackSkellington_7072326409 https://schema.org/brand http://semanticweb2025.group5/vinted/Jack\n",
      "http://semanticweb2025.group5/vinted/Espresso http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Brand\n",
      "http://semanticweb2025.group5/vinted/item_JustKids_7075705549 https://schema.org/size 9.78E+12\n",
      "https://schema.org/color http://www.w3.org/2000/01/rdf-schema#domain https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/Accessories http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n",
      "http://semanticweb2025.group5/vinted/item_BlackAndWhiteConverseShoes_7072439359 https://schema.org/price 16.0\n",
      "http://semanticweb2025.group5/vinted/item_CoffeeShopClearanceEspressoMachine_7044963349 https://schema.org/brand http://semanticweb2025.group5/vinted/Espresso\n",
      "http://semanticweb2025.group5/vinted/item_StrawberryDish_7051854690 https://schema.org/brand http://semanticweb2025.group5/vinted/Sheffield\n",
      "http://semanticweb2025.group5/vinted/Video http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2000/01/rdf-schema#Class\n",
      "http://semanticweb2025.group5/vinted/item_SwingingPetBed_7035200361 https://schema.org/size L\n",
      "http://semanticweb2025.group5/vinted/item_SpoonTeabagPlate_6377063646 https://schema.org/price 3.0\n",
      "http://semanticweb2025.group5/vinted/item_LeopardPrintLingerieDress_7072400616 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/item_LattafaDukhan_7007038949 https://schema.org/price 5.0\n",
      "http://semanticweb2025.group5/vinted/item_LululemonTop_7058582204 https://schema.org/color White\n",
      "http://semanticweb2025.group5/vinted/item_LeopardPrintLingerieDress_7072400616 http://semanticweb2025.group5/vinted/primaryCategory http://semanticweb2025.group5/vinted/Women\n",
      "http://semanticweb2025.group5/vinted/item_Chogan118_3162020098 http://semanticweb2025.group5/vinted/secondaryCategory http://semanticweb2025.group5/vinted/Grooming\n",
      "http://semanticweb2025.group5/vinted/item_ButterflyEffectCollectionDVD_2653528041 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/item_CoachSignaturePurse_7051847400 https://schema.org/size not specified\n",
      "http://semanticweb2025.group5/vinted/item_PageMasterDVD_5785766723 http://semanticweb2025.group5/vinted/secondaryCategory http://semanticweb2025.group5/vinted/Video\n",
      "http://semanticweb2025.group5/vinted/item_KhakiBoots_7029761685 https://schema.org/price 20.0\n",
      "http://semanticweb2025.group5/vinted/item_DiorHomme_4241982335 http://semanticweb2025.group5/vinted/primaryCategory http://semanticweb2025.group5/vinted/Men\n",
      "http://semanticweb2025.group5/vinted/item_EdHardyBelt_7010159956 https://schema.org/size Adjustable\n",
      "http://semanticweb2025.group5/vinted/item_HocusPocusCookieCutters_6964566662 https://schema.org/size not specified\n",
      "http://semanticweb2025.group5/vinted/item_LanaDelReyChemtrailsCD_6721147567 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/item_PageMasterDVD_5785766723 https://schema.org/color not specified\n",
      "http://semanticweb2025.group5/vinted/item_PapaRoachParamourSessionsCD_7072381990 https://schema.org/size not specified\n",
      "http://semanticweb2025.group5/vinted/item_CoachSignaturePurse_7051847400 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/item_ButterflyEffectCollectionDVD_2653528041 https://schema.org/brand http://semanticweb2025.group5/vinted/BrandUnknown\n",
      "http://semanticweb2025.group5/vinted/item_HocusPocusCookieCutters_6964566662 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/item_TF_OudWood_7065882664 https://schema.org/color not specified\n",
      "http://semanticweb2025.group5/vinted/item_Steamer_7070621775 https://schema.org/price 10.0\n",
      "http://semanticweb2025.group5/vinted/item_VintageGuessShoulderBag_7059028695 http://semanticweb2025.group5/vinted/primaryCategory http://semanticweb2025.group5/vinted/Women\n",
      "http://semanticweb2025.group5/vinted/item_PapaRoachParamourSessionsCD_7072381990 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/item_CrockPotSmall_7008639345 https://schema.org/name Crock pot small\n",
      "http://semanticweb2025.group5/vinted/Chogan http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Brand\n",
      "http://semanticweb2025.group5/vinted/item_SambaAdidasLikeNew_7047990548 https://schema.org/price 50.0\n",
      "http://semanticweb2025.group5/vinted/secondaryCategory http://www.w3.org/2000/01/rdf-schema#subPropertyOf https://schema.org/category\n",
      "http://semanticweb2025.group5/vinted/item_CuteVintagePolkaDotTote_7028968164 https://schema.org/size not specified\n",
      "http://semanticweb2025.group5/vinted/item_LevisSize27_7061400391 https://schema.org/name Levi’s size 27\n",
      "http://semanticweb2025.group5/vinted/item_EnhypenRomanceUntoldAlbum_6871106441 https://schema.org/itemCondition Very good\n",
      "http://semanticweb2025.group5/vinted/Espresso https://schema.org/name Espresso\n",
      "http://semanticweb2025.group5/vinted/item_CoffeeShopClearanceEspressoMachine_7044963349 https://schema.org/color Silver\n",
      "https://schema.org/category http://www.w3.org/2000/01/rdf-schema#range http://semanticweb2025.group5/vinted/Category\n",
      "http://semanticweb2025.group5/vinted/item_VintageKoltovBlackShoulderBag_7070486725 https://schema.org/size not specified\n",
      "http://semanticweb2025.group5/vinted/Dior https://schema.org/name Dior\n",
      "http://semanticweb2025.group5/vinted/Lululemon https://schema.org/name Lululemon\n",
      "http://semanticweb2025.group5/vinted/Shoes http://www.w3.org/2000/01/rdf-schema#subClassOf http://semanticweb2025.group5/vinted/Women\n",
      "http://semanticweb2025.group5/vinted/item_ButterflyEffectCollectionDVD_2653528041 https://schema.org/size not specified\n",
      "http://semanticweb2025.group5/vinted/item_CuteVintagePolkaDotTote_7028968164 http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Product\n",
      "http://semanticweb2025.group5/vinted/item_TF_OudWood_7065882664 https://schema.org/brand http://semanticweb2025.group5/vinted/TomFord\n",
      "http://semanticweb2025.group5/vinted/Nike http://www.w3.org/1999/02/22-rdf-syntax-ns#type https://schema.org/Brand\n",
      "http://semanticweb2025.group5/vinted/item_LattafaDukhan_7007038949 http://semanticweb2025.group5/vinted/secondaryCategory http://semanticweb2025.group5/vinted/Grooming\n",
      "http://semanticweb2025.group5/vinted/item_JustKids_7075705549 https://schema.org/price 3.0\n"
     ]
    }
   ],
   "source": [
    "qres = \"\"\"\n",
    "SELECT DISTINCT ?s ?p ?o\n",
    "WHERE {\n",
    "\n",
    "  ?s ?p ?o .\n",
    "\n",
    "} LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "for row in g.query(qres):\n",
    "    print(f\"{row.s} {row.p} {row.o}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "a19788bf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Name: Abercrombie & Fitch Cropped Sweater Juniors Or Women’s Size XS Fall\n",
      "Category: http://semanticweb2025.group5/vinted/Women\n",
      "SubCategory: http://semanticweb2025.group5/vinted/Clothing\n",
      "Brand: http://semanticweb2025.group5/vinted/AbercrombieFitch\n"
     ]
    }
   ],
   "source": [
    "# For a given item (select a random item from your RDF Graph), provide all its\n",
    "# categories and subcategories, and its brand\n",
    "\n",
    "query_a = \"\"\"\n",
    "PREFIX schema: <https://schema.org/> \n",
    "PREFIX vinted: <http://semanticweb2025.group5/vinted/>\n",
    "\n",
    "SELECT ?item_name ?primary_category ?secondary_category ?item_brand\n",
    "WHERE {\n",
    "\n",
    "  ?item schema:name ?item_name;\n",
    "        vinted:primaryCategory ?primary_category;\n",
    "        vinted:secondaryCategory ?secondary_category;\n",
    "        schema:brand ?item_brand.\n",
    "\n",
    "\n",
    "} LIMIT 1\n",
    "\"\"\"\n",
    "for row in g.query(query_a):\n",
    "    print(f\"Name: {row.item_name}\\nCategory: {row.primary_category}\\nSubCategory: {row.secondary_category}\\nBrand: {row.item_brand}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "037df4c5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hit me hard and soft album record\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hit me hard and soft album record\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hit me hard and soft album record\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hit me hard and soft album record\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hit me hard and soft album record\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hit me hard and soft album record\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Page master dvd movie\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hit me hard and soft album record\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hit me hard and soft album record\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hit me hard and soft album record\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Page master dvd movie\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: Hit me hard and soft album record\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: The Page master dvd movie\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Hocus pocus cookie cutters\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "Item_2: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hit me hard and soft album record\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: Hit me hard and soft album record\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: The Page master dvd movie\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Shoes\n",
      "Item_2: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Page master dvd movie\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: Hit me hard and soft album record\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: The Page master dvd movie\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Leopard print lingerie dress\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Page master dvd movie\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hit me hard and soft album record\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Page master dvd movie\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Page master dvd movie\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Page master dvd movie\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Page master dvd movie\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Page master dvd movie\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Page master dvd movie\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Page master dvd movie\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Page master dvd movie\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hit me hard and soft album record\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hit me hard and soft album record\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Enhypen Romance: Untold Engene Ver Album\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Lana Del Rey \"Chemtrails over the Country Club\" CD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Papa Roach : The Paramour Sessions CD (2006) Geffen Nu-Metal B0007496-02 Club Edition\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Video\n",
      "Item_2: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Music\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Butterfly Effect Collection DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Hocus pocus cookie cutters\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Cookwarebakeware\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: I Spy a thing that flings and other stories DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: khaki green knee high boots punk with buckle detail\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Shoes\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Leopard print lingerie dress\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Page master dvd movie\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: Santa Claus is coming to Town DVD\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: BrandUnknown\n",
      "Item_1: Midnights Taylor Swift moonstone blue ed\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Music\n",
      "Item_2: The Simpsons DVD Collector’s Edition/ seasons 6 & 8\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Video\n",
      "\n",
      "\n",
      "Brand: Lululemon\n",
      "Item_1: Lululemon Dual Pouch Wristlet Black and Gold Wordmark New With Tags\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Bags\n",
      "Item_2: Lululemon top\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Clothing\n",
      "\n",
      "\n",
      "Brand: Lululemon\n",
      "Item_1: Lululemon top\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Clothing\n",
      "Item_2: Lululemon Dual Pouch Wristlet Black and Gold Wordmark New With Tags\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Bags\n",
      "\n",
      "\n",
      "Brand: Amazon\n",
      "Item_1: Steamer\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Smallkitchenappliances\n",
      "Item_2: Swinging pet bed\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Petcare\n",
      "\n",
      "\n",
      "Brand: Amazon\n",
      "Item_1: Swinging pet bed\n",
      "SubCategory_Item_1: http://semanticweb2025.group5/vinted/Petcare\n",
      "Item_2: Steamer\n",
      "SubCategory_Item_2: http://semanticweb2025.group5/vinted/Smallkitchenappliances\n"
     ]
    }
   ],
   "source": [
    "# Provide items from different subcategories that have the same brand.\n",
    "query_b = \"\"\"\n",
    "PREFIX schema: <https://schema.org/> \n",
    "PREFIX vinted: <http://semanticweb2025.group5/vinted/>\n",
    "\n",
    "SELECT ?brand_name ?item_name_1 ?item_subcategory_1 ?item_name_2 ?item_subcategory_2\n",
    "WHERE {\n",
    "\n",
    "    ?brand schema:name ?brand_name.\n",
    "\n",
    "    ?item schema:name ?item_name_1;\n",
    "        vinted:primaryCategory ?item_category_1;\n",
    "        vinted:secondaryCategory ?item_subcategory_1;\n",
    "        schema:brand ?brand.\n",
    "        \n",
    "    ?item2 schema:name ?item_name_2;\n",
    "        vinted:primaryCategory ?item_category_2;\n",
    "        vinted:secondaryCategory ?item_subcategory_2;\n",
    "        schema:brand ?brand.\n",
    "\n",
    "\n",
    "    FILTER(?item_subcategory_2!=?item_subcategory_1)\n",
    "\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "for row in g.query(query_b):\n",
    "    print(\"\\n\")\n",
    "    print(f\"Brand: {row.brand_name}\\nItem_1: {row.item_name_1}\\nSubCategory_Item_1: {row.item_subcategory_1}\\nItem_2: {row.item_name_2}\\nSubCategory_Item_2: {row.item_subcategory_2}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "c4827f7d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Abercrombie & Fitch 5.0\n",
      "BrandUnknown 7.538461538461538461538461538\n",
      "Converse 16.0\n",
      "Empyre 13.0\n",
      "Dolly 20.0\n",
      "Chogan 45.0\n",
      "Coach 55.0\n",
      "Espresso 55.0\n",
      "Corningware 12.0\n",
      "Crock Pot 10.0\n"
     ]
    }
   ],
   "source": [
    "# Group products by brand and show the average price or rating for each brand.\n",
    "query_c = \"\"\"\n",
    "PREFIX schema: <https://schema.org/> \n",
    "PREFIX vinted: <http://semanticweb2025.group5/vinted/>\n",
    "\n",
    "SELECT ?brand_name (AVG(?item_price) AS ?avg_price)\n",
    "WHERE {\n",
    "\n",
    "    ?brand schema:name ?brand_name.\n",
    "\n",
    "    ?item schema:brand ?brand;\n",
    "        schema:price ?item_price.\n",
    "\n",
    "\n",
    "\n",
    "} GROUP BY ?brand_name\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "for row in g.query(query_c):\n",
    "    print(f\"{row.brand_name} {row.avg_price}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "930c48b8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Brand:Lattafa\n",
      "Avg_price:5.0\n",
      "\n",
      "Brand:NO LABEL\n",
      "Avg_price:10.0\n",
      "\n",
      "Brand:Guy Clarac\n",
      "Avg_price:15.0\n",
      "\n",
      "Brand:The North Face\n",
      "Avg_price:15.0\n",
      "\n",
      "Brand:Ed Hardy\n",
      "Avg_price:20.0\n",
      "\n",
      "Brand:Dior\n",
      "Avg_price:40.0\n",
      "\n",
      "Brand:ibex\n",
      "Avg_price:40.0\n",
      "\n",
      "Brand:Chogan\n",
      "Avg_price:45.0\n",
      "\n",
      "Brand:Tom Ford\n",
      "Avg_price:75.0\n"
     ]
    }
   ],
   "source": [
    "# Sort products in one category according to average brand price or rating.\n",
    "query_d = \"\"\"\n",
    "PREFIX schema: <https://schema.org/> \n",
    "PREFIX vinted: <http://semanticweb2025.group5/vinted/>\n",
    "\n",
    "SELECT ?brand_name (AVG(?item_price) AS ?avg_price)\n",
    "WHERE {\n",
    "  ?item vinted:primaryCategory vinted:Men ;\n",
    "        schema:name ?item_name ;\n",
    "        schema:brand ?brand ;\n",
    "        schema:price ?item_price .\n",
    "  ?brand schema:name ?brand_name .\n",
    "}\n",
    "GROUP BY  ?brand_name\n",
    "ORDER BY ?avg_price\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "for row in g.query(query_d):\n",
    "    print(f\"\\nBrand:{row.brand_name}\\nAvg_price:{row.avg_price}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "eb7a7793",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "BrandUnknown 2 13.5\n",
      "Lululemon 2 15.0\n",
      "Abercrombie & Fitch 1 5.0\n",
      "Levi's 1 6.0\n",
      "Unique Vintage 1 7.0\n",
      "Empyre 1 13.0\n",
      "Converse 1 16.0\n",
      "GUESS 1 19.0\n",
      "Nike 1 20.0\n",
      "Skechers 1 20.0\n"
     ]
    }
   ],
   "source": [
    "# Brands in one category (Women) sorted by how many items they have + the brand's average price\n",
    "\n",
    "# This query shows which brands have the largest Men assortment and their average price, enabling smarter ranking, \n",
    "# filters, and brand curation. It also informs pricing and promotions by revealing typical price points per brand, \n",
    "# improving user expectations and conversion.\n",
    "\n",
    "query_g = \"\"\"\n",
    "PREFIX schema: <https://schema.org/> \n",
    "PREFIX vinted: <http://semanticweb2025.group5/vinted/>\n",
    "PREFIX xsd:    <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?brand_name (COUNT(?item) AS ?num_items) (AVG(xsd:decimal(?item_price)) AS ?avg_price)\n",
    "WHERE {\n",
    "  ?item vinted:primaryCategory vinted:Women ;\n",
    "        schema:brand ?brand ;\n",
    "        schema:price ?item_price .\n",
    "  ?brand schema:name ?brand_name .\n",
    "}\n",
    "GROUP BY ?brand_name\n",
    "ORDER BY DESC(?num_items) ?avg_price\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "for row in g.query(query_g):\n",
    "    print(f\"{row.brand_name} {row.num_items} {row.avg_price}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "f14fd731",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Brand: Adidas AG\n",
      "Inception: 1924-07-01T00:00:00Z\n",
      "Founder: Adolf Dassler\n",
      "Headquarters: Herzogenaurach\n",
      "Industries: textile industry, sport industry\n",
      "Website: https://adidas-group.com\n"
     ]
    }
   ],
   "source": [
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql_endpoint = \"https://query.wikidata.org/sparql\"\n",
    "\n",
    "query_e = \"\"\"\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX bd: <http://www.bigdata.com/rdf#>\n",
    "PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "\n",
    "SELECT ?brandLabel ?inceptionDate ?founderLabel ?headquartersLabel (GROUP_CONCAT(DISTINCT ?industryLabel; SEPARATOR=\", \") AS ?industries) ?officialWebsite\n",
    "WHERE {\n",
    "  BIND(wd:Q3895 AS ?brand)\n",
    "\n",
    "  OPTIONAL { ?brand wdt:P571 ?inceptionDate. }\n",
    "  OPTIONAL { ?brand wdt:P112 ?founder. }\n",
    "  OPTIONAL { ?brand wdt:P159 ?headquarters. }\n",
    "  OPTIONAL { ?brand wdt:P856 ?officialWebsite. }\n",
    "  OPTIONAL { ?brand wdt:P452 ?industry. }\n",
    "\n",
    "  SERVICE wikibase:label {\n",
    "    bd:serviceParam wikibase:language \"en\".\n",
    "    ?brand rdfs:label ?brandLabel.\n",
    "    ?founder rdfs:label ?founderLabel.\n",
    "    ?headquarters rdfs:label ?headquartersLabel.\n",
    "    ?industry rdfs:label ?industryLabel. \n",
    "  }\n",
    "}\n",
    "GROUP BY ?brandLabel ?inceptionDate ?founderLabel ?headquartersLabel ?officialWebsite\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "sparql = SPARQLWrapper(sparql_endpoint)\n",
    "sparql.setQuery(query_e)\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "brand_data = results[\"results\"][\"bindings\"][0]\n",
    "\n",
    "name = brand_data.get(\"brandLabel\", {}).get(\"value\")\n",
    "inception = brand_data.get(\"inceptionDate\", {}).get(\"value\")\n",
    "founder = brand_data.get(\"founderLabel\", {}).get(\"value\")\n",
    "hq = brand_data.get(\"headquartersLabel\", {}).get(\"value\")\n",
    "industries = brand_data.get(\"industries\", {}).get(\"value\")\n",
    "website = brand_data.get(\"officialWebsite\", {}).get(\"value\")\n",
    "\n",
    "print(f\"Brand: {name}\")\n",
    "print(f\"Inception: {inception}\")\n",
    "print(f\"Founder: {founder}\")\n",
    "print(f\"Headquarters: {hq}\")\n",
    "print(f\"Industries: {industries}\")\n",
    "print(f\"Website: {website}\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b3e74d93",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
